kk.yml
execution:
- concurrency: 3
  ramp-up: 1m
  hold-for: 3m
  scenario: quick-test
  locations: 
    eu-central-1: 1
    
scenarios:
  quick-test:
    requests:
    - http://blazedemo.com
reporting:
- module: passfail
  criteria:
  - "avg-rt>150ms for 10s, continue as failed"
  - "fail>50% for 10s, stop as failed"